"""Messages for bot"""

WELCOME = (
    "Вітаю 👋. Вибери будь ласка чергу ⬇️, по якій ти хочеш отримувати сповіщення 💡:"
)
ADMIN_UPDATE = "Вітаю! Список черг оновлено. ✅ "
ADMIN_RUN = "Команду виконано. ✅ "
ADMIN_FAIL = "❌ Помилка виконання команди."
SUBSCRIBE_TEXT = "✅ Успішно активовано отримання сповіщення для: "
UNSUBSCRIBE_TEXT = (
    "➡️ Натисни на чергу зі списку ⬇️, якщо ти не хочеш  🙅‍♂️ отримувати сповіщення 💡: "
)
UNSUBSCRIBED = "✔️ Успішно видалено отримання сповіщення для: "
NOT_UNSUBSCRIBED = "⚙️ Сповіщення вже було видалено або сталася помилка."
NONE_SUBSCRIBE_TEXT = "Не знайдено жодних сповіщеннь ⛔. Спочатку виберіть черги по яким отримувати сповіщення 💡: /start"
ALREADY_SUBSCRIBE_TEXT = "✔️ Ти вже отримуєш сповіщення для даної черги."
SUB_COMMAND_TEXT = "ℹ️ Для видалення сповіщень по чергам відправ мені команду: /remove"
X_MARK = "❌"
CHECK_MARK = "✅"
WAIT_MARK = "⌛"
NO_INFO_MARK = "❔"

NOTIFICATION_BEFORE_TEXT = "через"
NOTIFICATION_TURN_OFF = "хвилин можливе відключення світла"
NOTIFICATION_TURN_ON = "хвилин світло 💡 мають увімкнути"
NOTIFICATION_TURN_WAIT = "хвилин світло 💡 може бути виключено (але це не точно)"
NOTIFICATION_TURN_NO_INFO = "хвилин не відомо що відбудеться"
NOTIFICATION_CHANGED = " ℹ️ POE оновили графік відключення світла 💡."
ERROR = "❌ Помилка виконання команди."

STATUS_MAP = {
    "ON": "✅ Присутнє",
    "OFF": "❌ Відсутнє",
    "WAIT": "⌛ Можливе відключення",
    "NO_INFO": "❔ Немає інформації",
}

MARKS_MAP = {
    "ON": "✅",
    "OFF": "❌",
    "WAIT": "⌛",
    "NO_INFO": "❔",
}
